In [1]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse data structures: Series and DataFrame

## Series

A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [2]:
obj = pd.Series([4, 5, 6, 7, 8])

In [3]:
obj

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [4]:
obj.values

array([4, 5, 6, 7, 8], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj2 = pd.Series(data = [4, 5, 6, 7, 8], index = ['a', 'b', 'c', 'd', 'e'])

In [7]:
obj2

a    4
b    5
c    6
d    7
e    8
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
obj2['b']

5

In [10]:
obj2['c'] = 98

In [11]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [12]:
obj2[['a', 'b', 'c']]

a     4
b     5
c    98
dtype: int64

In [13]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [14]:
obj2 > 5

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [15]:
obj2[obj2 > 5]

c    98
d     7
e     8
dtype: int64

In [16]:
obj2 * 2

a      8
b     10
c    196
d     14
e     16
dtype: int64

In [17]:
obj2 ** 2

a      16
b      25
c    9604
d      49
e      64
dtype: int64

In [18]:
np.exp(obj2)

a    5.459815e+01
b    1.484132e+02
c    3.637971e+42
d    1.096633e+03
e    2.980958e+03
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dict

In [19]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [20]:
'd' in obj2

True

In [21]:
'g' not in obj2

True

In [22]:
dict_data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
dict_data

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = pd.Series(data = dict_data)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states = ['California', 'Oregon', 'Ohio', 'Utah']

In [27]:
states

['California', 'Oregon', 'Ohio', 'Utah']

In [28]:
obj4 = pd.Series(data = dict_data, index = states)

In [29]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [30]:
pd.isnull(obj4)

California     True
Oregon        False
Ohio          False
Utah          False
dtype: bool

In [31]:
pd.notnull(obj4)

California    False
Oregon         True
Ohio           True
Utah           True
dtype: bool

In [32]:
pd.notna(obj4)

California    False
Oregon         True
Ohio           True
Utah           True
dtype: bool

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [35]:
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon        32000.0
Texas             NaN
Utah          10000.0
dtype: float64

A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations

In [36]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
Name: population, dtype: float64

In [39]:
obj4.index.name = 'states'

In [40]:
obj4

states
California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
Name: population, dtype: float64

In [41]:
obj

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [42]:
obj.index = ['bob', 'smith', 'ali', 'dan', 'hud']

In [43]:
obj

bob      4
smith    5
ali      6
dan      7
hud      8
dtype: int64

A Series’s index can be altered in-place by assignment

## DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index.

In [44]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [45]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
df.head() #head() selects only the first five rows, used for larger df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [49]:
pd.DataFrame(data=data, columns=['pop', 'state', 'year'])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

If you pass a column that isn’t contained in the dict, it will appear with missing values in the result

In [50]:
df2 = pd.DataFrame(data, columns=['pop', 'state', 'year', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [51]:
df2

       pop   state  year debt
one    1.5    Ohio  2000  NaN
two    1.7    Ohio  2001  NaN
three  3.6    Ohio  2002  NaN
four   2.4  Nevada  2001  NaN
five   2.9  Nevada  2002  NaN
six    3.2  Nevada  2003  NaN

In [52]:
df2.columns

Index(['pop', 'state', 'year', 'debt'], dtype='object')

In [53]:
df2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

In [54]:
df2['year'] #More conventional one to select columns from df

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [55]:
df2.year #if method name and column name would be same then calamity will be upon us

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
df2.loc['three'] #To select rows from df use loc for user choosen index or iloc for default integer index

pop       3.6
state    Ohio
year     2002
debt      NaN
Name: three, dtype: object

In [57]:
df2.iloc[2]

pop       3.6
state    Ohio
year     2002
debt      NaN
Name: three, dtype: object

In [58]:
df2

       pop   state  year debt
one    1.5    Ohio  2000  NaN
two    1.7    Ohio  2001  NaN
three  3.6    Ohio  2002  NaN
four   2.4  Nevada  2001  NaN
five   2.9  Nevada  2002  NaN
six    3.2  Nevada  2003  NaN

In [59]:
df2['debt'] = np.mean(df['pop'])

In [60]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000  2.55
two    1.7    Ohio  2001  2.55
three  3.6    Ohio  2002  2.55
four   2.4  Nevada  2001  2.55
five   2.9  Nevada  2002  2.55
six    3.2  Nevada  2003  2.55

In [61]:
df2['debt'] = np.arange(6.0)

In [62]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   0.0
two    1.7    Ohio  2001   1.0
three  3.6    Ohio  2002   2.0
four   2.4  Nevada  2001   3.0
five   2.9  Nevada  2002   4.0
six    3.2  Nevada  2003   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes

In [63]:
col = pd.Series(data=[-1.5, 4.56, -8.5], index=['two', 'three', 'six'])

In [64]:
col

two     -1.50
three    4.56
six     -8.50
dtype: float64

In [65]:
df2['debt'] = col

In [66]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

In [67]:
df2.notna()

        pop  state  year   debt
one    True   True  True  False
two    True   True  True   True
three  True   True  True   True
four   True   True  True  False
five   True   True  True  False
six    True   True  True   True

In [68]:
df2['eastern'] = df2['state'] == 'Ohio'

In [69]:
df2

       pop   state  year  debt  eastern
one    1.5    Ohio  2000   NaN     True
two    1.7    Ohio  2001 -1.50     True
three  3.6    Ohio  2002  4.56     True
four   2.4  Nevada  2001   NaN    False
five   2.9  Nevada  2002   NaN    False
six    3.2  Nevada  2003 -8.50    False

New columns cannot be created with the df2.eastern syntax

In [70]:
df2

       pop   state  year  debt  eastern
one    1.5    Ohio  2000   NaN     True
two    1.7    Ohio  2001 -1.50     True
three  3.6    Ohio  2002  4.56     True
four   2.4  Nevada  2001   NaN    False
five   2.9  Nevada  2002   NaN    False
six    3.2  Nevada  2003 -8.50    False

In [71]:
del df2['eastern'] #deletes column permenantly

In [72]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

Another common form of data is a nested dict of dicts

In [73]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [74]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices

In [75]:
df4 = pd.DataFrame(pop, index=[2000,2001,2002])

In [76]:
df4

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array

In [77]:
df4.transpose()

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [78]:
df4.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [79]:
dict_df = {'Ohio': df4['Ohio'][:-1], 'Nevada': df4['Nevada'][:-1]}

In [80]:
pd.DataFrame(dict_df, columns=['Nevada', 'Ohio'])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [81]:
df4

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [82]:
df4.index.name = 'Year'
df4.columns.name = "States"

In [83]:
df4

States  Nevada  Ohio
Year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [84]:
df4.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [85]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

In [86]:
df2.values

array([[1.5, 'Ohio', 2000, nan],
       [1.7, 'Ohio', 2001, -1.5],
       [3.6, 'Ohio', 2002, 4.56],
       [2.4, 'Nevada', 2001, nan],
       [2.9, 'Nevada', 2002, nan],
       [3.2, 'Nevada', 2003, -8.5]], dtype=object)

Table 5-1. Possible data inputs to DataFrame constructor

## Index Objects

In [87]:
obj = pd.Series(data=range(3), index=['a', 'b', 'c'])

In [88]:
obj

a    0
b    1
c    2
dtype: int64

In [89]:
index = obj.index

In [90]:
index

Index(['a', 'b', 'c'], dtype='object')

In [91]:
index[:-1]

Index(['a', 'b'], dtype='object')

Index objects are immutable and thus can’t be modified by the user

In [92]:
index[2]

'c'

In [93]:
"index[2] = 'z'" #Type Error

"index[2] = 'z'"

Immutability makes it safer to share Index objects among data structures

In [94]:
labels = pd.Index(np.arange(3))

In [95]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [96]:
obj2 = pd.Series([1.5, -6.5, +7.4], index=labels)

In [97]:
obj2

0    1.5
1   -6.5
2    7.4
dtype: float64

In [98]:
obj2.index is labels

True

In [99]:
df4

States  Nevada  Ohio
Year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [100]:
df4.columns

Index(['Nevada', 'Ohio'], dtype='object', name='States')

In [101]:
'Nevada' in df4.columns

True

In [102]:
2003 in df4.columns

False

Unlike Python sets, a pandas Index can contain duplicate labels

In [103]:
dup_index = pd.Index(['a', 'a', 'b', 'c' ])

In [104]:
ser1 = pd.Series(data=[1, 2, 2, 5], index=dup_index)
ser1

a    1
a    2
b    2
c    5
dtype: int64

Selections with duplicate labels will select all occurrences of that label

In [105]:
ser1['a'][0]

1

In [106]:
ser1['a'][1]

2

See Table 5-2 for some Index methods and properties

# 5.2 Essential Functionality

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index

In [107]:
obj = pd.Series(data=[5.4, -8.5, 45.23, 1.2], index=['d', 'a', 'c', 'b'])

In [108]:
obj

d     5.40
a    -8.50
c    45.23
b     1.20
dtype: float64

In [109]:
obj2 = obj.reindex(index=['a', 'b', 'c', 'd', 'e'])

In [110]:
obj2

a    -8.50
b     1.20
c    45.23
d     5.40
e      NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or fill‐
ing of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values

In [111]:
obj3 = pd.Series(data=[1.5, 2.5, 5], index=[2, 3, 5])

In [112]:
obj3

2    1.5
3    2.5
5    5.0
dtype: float64

In [113]:
obj3.reindex(index=range(6), method='ffill')

0    NaN
1    NaN
2    1.5
3    2.5
4    2.5
5    5.0
dtype: float64

In [114]:
obj3.reindex(index=range(6), method='nearest')

0    1.5
1    1.5
2    1.5
3    2.5
4    5.0
5    5.0
dtype: float64

In [115]:
df = pd.DataFrame(data=np.arange(9).reshape(3,3), index=['a', 'b', 'c'], columns=['Texas', 'Ohio', 'Nevada'])

In [116]:
df

   Texas  Ohio  Nevada
a      0     1       2
b      3     4       5
c      6     7       8

In [117]:
df2 = df.reindex(index=['a', 'b', 'c', 'd']) #Row reindexing

In [118]:
df2

   Texas  Ohio  Nevada
a    0.0   1.0     2.0
b    3.0   4.0     5.0
c    6.0   7.0     8.0
d    NaN   NaN     NaN

In [119]:
df3 = df2.reindex(columns=['Texas', 'Ohio', 'Nevada', 'California'])

In [120]:
df3

   Texas  Ohio  Nevada  California
a    0.0   1.0     2.0         NaN
b    3.0   4.0     5.0         NaN
c    6.0   7.0     8.0         NaN
d    NaN   NaN     NaN         NaN

In [121]:
df3.loc[['a', 'b', 'c'], ['Texas', 'California']]

   Texas  California
a    0.0         NaN
b    3.0         NaN
c    6.0         NaN

Table 5-3. reindex function arguments

In [122]:
df3.loc['d'].fillna(value=np.mean(df['Ohio']))

Texas         4.0
Ohio          4.0
Nevada        4.0
California    4.0
Name: d, dtype: float64

## Dropping Entries from an Axis

In [123]:
ser = pd.Series(data=np.arange(6), index=[chr(i) for i in range(97, 97+6)])

In [124]:
ser

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [125]:
new_ser = ser.drop('c') #Dropping rows with axis=0

In [126]:
new_ser

a    0
b    1
d    3
e    4
f    5
dtype: int32

In [127]:
ser.drop(['d', 'e'])

a    0
b    1
c    2
f    5
dtype: int32

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [131]:
data.drop(['Ohio', 'Utah']).drop(['four'], axis=1) #Dropping columns with axis = 1

          one  two  three
Colorado    4    5      6
New York   12   13     14

In [132]:
data.drop(['two'], inplace=True, axis=1) #inplace -> permenantly

In [133]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

Be careful with the inplace, as it destroys any data that is dropped.

## Indexing, Selection, and Filtering

In [134]:
ser = pd.Series(data=np.arange(5), index=[chr(i) for i in range(97, 97+5)])

In [135]:
ser

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [136]:
ser['d']

3

In [137]:
ser['c':'e']

c    2
d    3
e    4
dtype: int32

In [138]:
ser[2:5]

c    2
d    3
e    4
dtype: int32

In [139]:
ser[['a', 'c', 'd']]

a    0
c    2
d    3
dtype: int32

In [140]:
ser[[1, 3, 4]]

b    1
d    3
e    4
dtype: int32

In [141]:
ser[ser<2]

a    0
b    1
dtype: int32

In [142]:
ser['b':'d'] = np.mean(ser)

In [143]:
ser

a    0.0
b    2.0
c    2.0
d    2.0
e    4.0
dtype: float64

In [144]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [145]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [146]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [147]:
data[['three', 'four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [148]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data[0:1]

      one  two  three  four
Ohio    0    1      2     3

In [150]:
type(data[0:1])

pandas.core.frame.DataFrame

In [151]:
data.loc['Ohio']

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [152]:
type(data.loc['Ohio'])

pandas.core.series.Series

In [153]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data[data < 6] = 0

In [155]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [156]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [157]:
data.loc['Colorado', ['two','three']]

two      0
three    6
Name: Colorado, dtype: int32

In [158]:
data.iloc[1, [1, 2]]

two      0
three    6
Name: Colorado, dtype: int32

In [159]:
data.iloc[-1]

one      12
two      13
three    14
four     15
Name: New York, dtype: int32

In [160]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
data.iloc[[1,2], [0,1,3]]

          one  two  four
Colorado    0    0     7
Utah        8    9    11

In [162]:
data.loc[:'Utah', 'one':'three']

          one  two  three
Ohio        0    0      0
Colorado    0    0      6
Utah        8    9     10

In [163]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [164]:
data.at['Utah', 'three']

10

In [165]:
data.iat[3,1]

13

## Integer Indexes

In [166]:
ser = pd.Series(np.arange(5.0))

In [167]:
ser

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [168]:
"ser[-1]" #KeyError

'ser[-1]'

Inferring what the user wants (label-based indexing or position-based) is difficult

On the other hand, with a non-integer index, there is no potential for ambiguity

In [169]:
ser2 = pd.Series(np.arange(5.0), index=['a', 'b', 'c', 'd', 'e'])

In [170]:
ser2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [171]:
ser2[-1]

4.0

In [172]:
# Labels can be negative integer

In [173]:
ser[:1] #Integer based

0    0.0
dtype: float64

In [174]:
ser.loc[:1] #Label based

0    0.0
1    1.0
dtype: float64

In [175]:
ser.iloc[:1] #Integer based

0    0.0
dtype: float64

## Arithmetic and Data Alignment

In [176]:
s1 = pd.Series(data=np.arange(4), index=['a', 'b', 'c', 'e'])

In [177]:
s2 = pd.Series(data=np.arange(6,10), index=['c', 'b', 'g', 'f'])

In [178]:
s1

a    0
b    1
c    2
e    3
dtype: int32

In [179]:
s2

c    6
b    7
g    8
f    9
dtype: int32

In [180]:
s1 + s2

a    NaN
b    8.0
c    8.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [181]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [182]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [183]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [184]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
df1 + df2 #Consider it as outer join in SQL

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [186]:
df1 = pd.DataFrame({'A': [1, 2]})

In [187]:
df1

   A
0  1
1  2

In [188]:
df2 = pd.DataFrame({'B': [3, 4]})

In [189]:
df2

   B
0  3
1  4

In [190]:
df1 * df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

In [191]:
df1 = pd.DataFrame(data=np.arange(12).reshape(3,4), columns=list('abcd'))

In [192]:
df2 = pd.DataFrame(data=np.arange(20).reshape(4,5), columns=list('abcde'))

In [193]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [194]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [195]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [196]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [197]:
df1.multiply(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

In [198]:
#df2['a'] = df1['a'] + df2['a']

In [199]:
#df2

In [200]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [201]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [202]:
df1 = df1.reindex(columns=df2.columns, fill_value=0)

In [203]:
df1

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [204]:
df1 = df1.reindex(index=df2.index, fill_value=0)

In [205]:
df1

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0
3  0  0   0   0  0

In [206]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [208]:
df1.pow(df2)

            a           b          c          d  e
0           1           1          4         27  0
1        1024       15625     279936    5764801  0
2  1073741824  1316288537 -727379968 -234981317  0
3           0           0          0          0  0

In [209]:
df2.pow(df1)

           a           b           c           d  e
0          1           1           4          27  1
1        625        7776      117649     2097152  1
2  100000000 -1937019605  1787822080  1159031605  1
3          1           1           1           1  1

### Operations between DataFrame and Series

In [210]:
arr = np.arange(12).reshape(3,4)

In [211]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [212]:
arr[0]

array([0, 1, 2, 3])

In [213]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

When we subtract arr[0] from arr, the subtraction is performed once for each row.
This is referred to as broadcasting

In [216]:
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=list('abcd'), index=['NY', 'Colorado', 'Utah'])

In [217]:
df

          a  b   c   d
NY        0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

In [219]:
ser = df.iloc[0]

In [222]:
ser

a    0
b    1
c    2
d    3
Name: NY, dtype: int32

Index wise operation

In [221]:
df - ser

          a  b  c  d
NY        0  0  0  0
Colorado  4  4  4  4
Utah      8  8  8  8

In [223]:
df + ser

          a   b   c   d
NY        0   2   4   6
Colorado  4   6   8  10
Utah      8  10  12  14

In [238]:
ser2 = pd.Series(range(3), index=list('abc'))

In [239]:
ser2

a    0
b    1
c    2
dtype: int64

In [240]:
df + ser2

            a     b     c   d
NY        0.0   2.0   4.0 NaN
Colorado  4.0   6.0   8.0 NaN
Utah      8.0  10.0  12.0 NaN

In [243]:
ser3 = df['d']

In [244]:
ser3

NY           3
Colorado     7
Utah        11
Name: d, dtype: int32

In [251]:
df.sub(ser3, axis=0)

          a  b  c  d
NY       -3 -2 -1  0
Colorado -3 -2 -1  0
Utah     -3 -2 -1  0

In [249]:
df

          a  b   c   d
NY        0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

The axis number that you pass is the axis to match on. In this case we mean to match
on the DataFrame’s row index (axis='index' or axis=0) and broadcast across

## Function Application and Mapping

In [256]:
df = pd.DataFrame(data=np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [257]:
df

               b         d         e
Utah   -0.165588 -1.129893 -0.164179
Ohio    0.186974  0.616373 -0.017344
Texas   2.501801  0.547106 -1.057898
Oregon -0.265047 -0.020651  0.813525

In [258]:
np.abs(df)

               b         d         e
Utah    0.165588  1.129893  0.164179
Ohio    0.186974  0.616373  0.017344
Texas   2.501801  0.547106  1.057898
Oregon  0.265047  0.020651  0.813525

In [265]:
f = lambda x: x.max() - x.min()

In [266]:
df.apply(f)

b    2.766847
d    1.746266
e    1.871423
dtype: float64

In [267]:
df.apply(f, axis=1)

Utah      0.965713
Ohio      0.633718
Texas     3.559698
Oregon    1.078572
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

In [278]:
def f(x):
    return pd.Series([x.min(), x.max(), x.count()], index=['min', 'max', 'count'])

In [279]:
df.apply(f)

              b         d         e
min   -0.265047 -1.129893 -1.057898
max    2.501801  0.616373  0.813525
count  4.000000  4.000000  4.000000

In [280]:
df

               b         d         e
Utah   -0.165588 -1.129893 -0.164179
Ohio    0.186974  0.616373 -0.017344
Texas   2.501801  0.547106 -1.057898
Oregon -0.265047 -0.020651  0.813525

apply() is used for applyng row wise or column wise function, applymap() is used for applying element wise function

In [283]:
t = lambda x: "%.2f" % x

In [285]:
df.applymap(t)

            b      d      e
Utah    -0.17  -1.13  -0.16
Ohio     0.19   0.62  -0.02
Texas    2.50   0.55  -1.06
Oregon  -0.27  -0.02   0.81

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [298]:
df['b'].map(t)

Utah      -0.17
Ohio       0.19
Texas      2.50
Oregon    -0.27
Name: b, dtype: object

## Sorting and Ranking

In [299]:
obj = pd.Series(data=range(5), index=list('dcbae'))

In [300]:
obj

d    0
c    1
b    2
a    3
e    4
dtype: int64

In [301]:
obj.sort_index() #Labels in lexicographically in ascending order

a    3
b    2
c    1
d    0
e    4
dtype: int64

In [302]:
obj.sort_index(ascending=False) #Labels in lexicographically in descending order

e    4
d    0
c    1
b    2
a    3
dtype: int64

In [304]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [305]:
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [312]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [313]:
df.sort_index(axis=1).sort_index(axis=0)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [315]:
ser = pd.Series(data=[4, 7, -3, 2])

In [316]:
ser

0    4
1    7
2   -3
3    2
dtype: int64

In [317]:
ser.sort_values() #Sorting values in Ascending order

2   -3
3    2
0    4
1    7
dtype: int64

In [318]:
ser.sort_values(ascending=False) #Sorting values in Descending order

1    7
0    4
3    2
2   -3
dtype: int64

In [319]:
ser = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [320]:
ser

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [321]:
ser.sort_values() #NaN values are sorted to the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [322]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [323]:
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [325]:
df.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [326]:
df.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [327]:
df.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.

In [328]:
obj = pd.Series(data=[5, -1, 7, 8, -9, 0, 5])

In [329]:
obj

0    5
1   -1
2    7
3    8
4   -9
5    0
6    5
dtype: int64

In [330]:
obj.rank()

0    4.5
1    2.0
2    6.0
3    7.0
4    1.0
5    3.0
6    4.5
dtype: float64

In [331]:
obj.rank(method='first')

0    4.0
1    2.0
2    6.0
3    7.0
4    1.0
5    3.0
6    5.0
dtype: float64

In [332]:
obj.rank(ascending=False, method='max') #Ranking in descending with method max

0    4.0
1    6.0
2    2.0
3    1.0
4    7.0
5    5.0
6    4.0
dtype: float64

In [334]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [335]:
df

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [336]:
df.rank() #rank with axis=0

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [337]:
df.rank(axis=1) #rank with axis=1

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

Table 5-6. Tie-breaking methods with rank

## Axis Indexes with Duplicate Labels

In [338]:
ser= pd.Series(data=[1, 1, 2, 3, 4], index=['a', 'b', 'c', 'd', 'a'])

In [339]:
ser

a    1
b    1
c    2
d    3
a    4
dtype: int64

In [342]:
ser.index.is_unique

False

In [347]:
ser['a']

a    1
a    4
dtype: int64

In [348]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [349]:
df

          0         1         2
a -0.830295  1.803871 -0.458153
a  1.071706 -0.855608 -0.385535
b -0.077308 -0.833131  0.917856
b  1.189046 -0.088958 -0.305330

In [352]:
df.loc['b']

          0         1         2
b -0.077308 -0.833131  0.917856
b  1.189046 -0.088958 -0.305330

# 5.3 Summarizing and Computing Descriptive Statistics